ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/IWDT_1.0.xml
    <register id="IWDT_TSCTL" width="32" offset="0x116C" description="Time Stamp Control Register">
        <bitfield id="TSTIOEN0" description="Time Stamp by Tamper I/O 0 enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSVDDEN" description="Time Stamp by VDD Loss detection enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="function disabled"/>
            <bitenum id="ENABLE" value="0x1" description="function enabled"/>
        </bitfield>
        <bitfield id="TSCAPTURE" description="Defines the capture method of the RTC timestamp when a time stamp event occurens." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="FIRST" value="0x0" description="Time stamp holds RTC capture at first occurrence of time stamp event."/>
            <bitenum id="LAST" value="0x1" description="Time stamp holds RTC capture at last occurrence of time stamp event."/>
        </bitfield>
    </register>
    <register id="IWDT_TSCLR" width="32" offset="0x1170" description="Time Stamp Clear Register">
        <bitfield id="CLR" description="Clear time stamp and status register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="clear time stamp event"/>
        </bitfield>
    </register>
    <register id="IWDT_LFSSRST" width="32" offset="0x11F0" description="Low frequency sub-system reset request">
        <bitfield id="VBATPOR" description="If set, the register bit will request a power on reset to the PMU of the LFSS." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing this value has no effect."/>
            <bitenum id="SET" value="0x1" description="Request power on reset to the LFSS."/>
        </bitfield>
    </register>
    <register id="IWDT_RTCLOCK" width="32" offset="0x11FC" description="Real time clock lock register">
        <bitfield id="PROTECT" description="If set, the register bit will protect the CLKCTL, SEC, MIN, HOUR, DAY, MON, YEAR and LFSSRST from accidental writes." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR" value="0x0" description="RTC counter is writable."/>
            <bitenum id="SET" value="0x1" description="RTC counter is read only access."/>
        </bitfield>
    </register>
    <register id="IWDT_TIOCTL" width="32" offset="0x1200" description="Tamper I/O Control Register">
        <bitfield id="IOMUX" description="tamper I/O is controlled by SoC IOMUX module" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="IOMUX" value="0x0" description="The tamper I/O is controlled by the IOMUX of the SoC and does allow assignment to a peripheral function. In the case the main supply (VDD) is lost, this I/O will go into a Hi-Z state."/>
            <bitenum id="TAMPER" value="0x1" description="The tamper I/O is controlled by the TIOCTL register and stays functional during loss of the main supply (VDD)."/>
        </bitfield>
        <bitfield id="PIPD" description="pull down enable" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The pull-down function is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The pull-down function is enabled."/>
        </bitfield>
        <bitfield id="PIPU" description="pull up enable" begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The pull-up function is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The pull-up function is enabled."/>
        </bitfield>
        <bitfield id="INENA" description="input enable" begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The input path is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The input path is enabled."/>
        </bitfield>
        <bitfield id="POLARITY" description="Enables and configures edge detection polarity for TIO" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Edge detection disabled"/>
            <bitenum id="RISE" value="0x1" description="Detects rising edge of input event"/>
            <bitenum id="FALL" value="0x2" description="Detects falling edge of input event"/>
            <bitenum id="BOTH" value="0x3" description="Detects both rising and falling edge of input event"/>
        </bitfield>
        <bitfield id="FILTEREN" description="Programmable counter length of digital glitch filter for TIO0" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="NO_FLT" value="0x0" description="no filter on the tamper I/O beyond CDC synchronization sample"/>
            <bitenum id="FLT_1" value="0x1" description="1 FLCLK minimum sample (30us)"/>
            <bitenum id="FLT_2" value="0x2" description="3 LFCLK minimum sample (100us)"/>
            <bitenum id="FLT_3" value="0x3" description="6 LFCLK minimum sample (200us)"/>
        </bitfield>
        <bitfield id="TOUTSEL" description="Selects the source for TOUT control" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="TOUT" value="0x0" description="The TOUT register is the source for TOUT"/>
            <bitenum id="LFCLKEXT" value="0x1" description="The LFCLK is the source for TOUT"/>
            <bitenum id="HEARTBEAT" value="0x2" description="The heart beat generatore is the source for TOUT"/>
            <bitenum id="TSEVTSTAT" value="0x3" description="The time stamp event status is the source for TOUT"/>
        </bitfield>
        <bitfield id="OUTINV" description="Output inversion enable" begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISBALE" value="0x0" description="The output inversion is disabled."/>
            <bitenum id="ENABLE" value="0x1" description="The output inversion is enabled."/>
        </bitfield>
    </register>
